[
  {
    "firstname": "aminah",
    "surname": "bongaros",
    "degree": "BSA",
    "quote": "I wish there are prayer rooms for other religions. Also, people are hesitant to approach me because there is an impression of conservatism. More awareness about the religion and other minorities would help a lot."
  },
  {
    "firstname": "john lexter",
    "surname": "cayabyab",
    "degree": "CIV",
    "quote": "I failed one GE, and now I’m not eligible for Latin honor even if my CGPA is enough. I hope the next USG could lobby for a more lenient policy on Latin honors."
  },
  {
    "firstname": "elijah nichol",
    "surname": "ng",
    "degree": "IE",
    "quote": "The next USG should balance the woke ideology for both sides to be seen. I’ve always been on the left side but I think there should be more rightist projects."
  },
  {
    "firstname": "tamara",
    "surname": "cloa",
    "degree": "AB-POM",
    "quote": "As part of The Lasallian Youth Orchestra, I am thankful for the current USG for everything they’ve done for us but I wish we could be seen in more performances supported by the next USG."
  },
  {
    "firstname": "rekiya",
    "surname": "lambino",
    "degree": "BSA",
    "quote": "The USG had become more inclusive towards the LGBTQIA+ community and the next set of Lasallian leaders should continue what they’ve started and do more."
  },
  {
    "firstname": "robin",
    "surname": "mabanag",
    "degree": "BS-MGT",
    "quote": "Just retain the great run of the USG and hopefully the next USG leaders can do more."
  },
  {
    "firstname": "kayla",
    "surname": "cruz",
    "degree": "AB-PSM",
    "quote": "I hope they build more student support and relationship-building programs among colleges"
  },
  {
    "firstname": "dave",
    "surname": "twan",
    "degree": "BS-ENT",
    "quote": "Implement more fun and exciting interactive activities."
  },
  {
    "firstname": "charles",
    "surname": "lo",
    "degree": "BS-ENT",
    "quote": "I hope to see more charity-based project to help students or communities in need."
  }
]
